# 4. Пользователь вводит две буквы.
# Определить, на каких местах алфавита они стоят, и сколько между ними находится букв.
letter_start = input('введите от какой буквы ')
#запрашиваем у пользователя букву начало и конца отчета в алфавитном порядке.
letter_finish = input('введите до какой буквы ')
#из словаря получаем цифровое значение буквы
dic = {'a': 0, 'b': 1, 'c' : 2, 'd' : 3, 'e': 4, 'f': 5, 'g': 6, 'h': 7, 'i': 8, 'j': 9, 'k': 10, 'l': 11, 'm': 12, 'n': 13, 'o': 14, 'p': 15,
       'q': 16, 'r': 17, 's': 18, 't':19, 'u': 20, 'v': 21, 'w':22,'x' : 23,'y': 24, 'z':25}

alphabet =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q','r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
print(f'{dic[letter_start]+1} - место в алфавите')
#выводим на экран место в алфавите числом для первой и второй буквы 
print(f'{dic[letter_finish]+1} - место в алфавите')
#итог получаем из вычитания числа положения последней буквы до начальной и получаем разницу, выводим на экран результат
print(f'{(dic[letter_finish]+1) - (dic[letter_start]+1)} - столько между ними букв')