# 6. По длинам трех отрезков, введенных пользователем, определить возможность существования
# треугольника, составленного из этих отрезков.
# Если такой треугольник существует, то определить,
# является ли он разносторонним, равнобедренным или равносторонним.
a = int(input('введите длину первой стороны'))
b = int(input('введите длину второй стороны'))
c = int(input('введите длину третьей стороны' + '\n'))
#запрашиваем у пользователя длину всех сторон поочередно и проводим логическое сравнение этих сторон
if a > 0 and b > 0 and c > 0:
#если одна из сторон меньше 0 или 0 то такого не может быть в ином случае проверяем на стороны
    print('такой треугольник может существовать и он' + '\n')
    if a == b or a == c or b == c:
    #если 2 стороны равны проверяем по логической связке все стороны поочередно и при совпадении одного из условий выводим
    #что треугольник является равнобедренным
        print('равнобедренный')
    elif a == b and a == c and b == c:
   #аналогично проверяем уже равенство всех сторон и если условие верно то выводим что треугольник равнобедренный
        print('равносторонний')
    else:
  #либо он является разносторонним , что логично :)
        print('разносторонний')
else:
    print('треугольник не может существовать')