# 2. По введенным пользователем координатам двух точек вывести
# уравнение прямой вида y = kx + b, проходящей через эти точки.

# Получаем значения координат первой точки и присвоить их переменным, например x1 и y1.
x1 = float(input('введите координату x1'))
y1 = float(input('введите координату y1'))
# Получить значения координат (x2, y2) второй точки.
x2 = float(input('введите координату x2'))
y2 = float(input('введите координату y2'))
# Вычисляем значение k по формуле k = (y1 – y2) / (x1 – x2).
k = ((y1 - y2) / (x1 - x2))

print(f'{k:.2f}')

# Вычисляем значение b по формуле b = y2 – k * x2.
b = y2 - (k * x2)
print(f'{b:.2f}')

print(f'y = (({k:.2f} * x) + {b:.2f})')