# 3. Написать программу, которая генерирует в указанных пользователем границах:
# a. случайное целое число,
# b. случайное вещественное число,
# c. случайный символ.
# Для каждого из трех случаев пользователь задает свои границы диапазона.
# Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы.
# Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.

# a. случайное целое число
#подключаем генератор случайных чисел
import random
#делаем запрос у пользователя целого числа и делаем разбивку в листе []
q = input('введите диапазон целых чисел через пробел').split(' ') 
#присваиваем переменной введные значения из нашего листа по индексам 0 и 1 и получем случайное число в заданном диапазоне
a = random.randrange(int(q[0]),int(q[1]))
print(a) #выводим результат на экран


# b. случайное вещественное число
#делаем запрос у пользователя вещественное число
q_float = float(input('введите максимальный диапазон для вещественного числа больше которого оно не может быть'))
#присваиваем значение переменной и делим на случайное нечетное число, чтобы с большей вероятностью получить именно число со значениями после запятой например 1.3
a = random.randrange(q_float)/1.3
print(float(f'{a:.3f}'))#выводим результат на экран

#генерация случайной буквы/символа
#генерируем словарь с большой или с маленькой буквы в любом случае можно преобразовать через метод .lower() либо .upper()
alphabet =['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q','R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
#вводим для значения переменной общее количество букв в латинском алфивите 26 - 1 , за счет индексирования от 0, а не от 1 цы
b = random.randint(0, 25)

print(alphabet[b]) #получаем случайную букву из алфавита

#генерация случайной буквы в заданном диапазоне
#запрашиваем первый символ от которого начать генерацию
letter_start = input('введите от какой буквы ')
#запрашиваем второй символ от которого начать генерацию
letter_finish = input('введите до какой буквы ')
#генерируем словарь по буквам с разметкой по соответсвующей цифре в алфавите - 1, для преобразования буквы в число**!
dic = {'a': 0, 'b': 1, 'c' : 2, 'd' : 3, 'e': 4, 'f': 5, 'g': 6, 'h': 7, 'i': 8, 'j': 9, 'k': 10, 'l': 11, 'm': 12, 'n': 13, 'o': 14, 'p': 15,
       'q': 16, 'r': 17, 's': 18, 't':19, 'u': 20, 'v': 21, 'w':22,'x' : 23,'y': 24, 'z':25}
#генерируем словарь обычный словарь
alphabet =['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q','R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']
#получаем по ключу цифровое значение буквы в алфавите и генерируем в этом диапазоне случайную букву уже из обычно [] списка по индексу из генератора.
b = random.randint(dic[letter_start], dic[letter_finish])

print(b) #берем рандомный индекс от алфавита в нужном диапазоне/проверяем

print(alphabet[b]) #выводим итоговый результат в рандомном порядке, каждый раз будет генерироваться случайно.