# 1. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.

# Присвоим переменным x и y значения чисел 5 и 6 соответсвенно
x = 5
y = 6
# Начем выполнять операции с ними. Начиная с & (И, AND)
z = x & y
print('x = ', x) #выведем для наглядности первый аргумент
print('y = ', y) #выведем для наглядности второй аргумент
print('z ' + 'результат операции & (И, AND) = ', z,  '\n') #и результат операции

# #выполним следующую операцию ИЛИ

# # Битовое ИЛИ (OR)
z = x | y
print('x = ', x)
print('y = ', y)
print('z ' + 'результат операции ИЛИ (OR) = ', z,  '\n')

#Выполним над числом 5 побитовый сдвиг вправо
print(x>>2)
#Выполним над числом 5 побитовый сдвиг влево
print(x<<2)

#Битовый оператор - исключающее ИЛИ (XOR)
z = x ^ y
print('x = ', x)
print('y = ', y)
print('z ' + 'исключающее ИЛИ (XOR) = ', z)