# 1. Поработайте с переменными, создайте несколько, выведите на экран, запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

name = 'Vlad'
age = 32
human = True
city = 'Yekaterinburg'

print('Имя -', name, 'Возраст -', age, 'Человек -',  human, 'Город -', city)

your_name = str(input('Введите имя'))

your_age = int(input('Введите ваш возраст'))

print('Ваше имя', your_name, 'Ваш возраст', your_age)

# 2. Пользователь вводит время в секундах. Переведите время в часы, минуты и секунды и выведите в формате чч:мм:сс. Используйте форматирование строк.

user_time_in_sec = int(input('Введите время в секундах'))

hours = user_time_in_sec // 3600
minutes = user_time_in_sec % 3600 // 60
seconds = user_time_in_sec % 3600 % 60

print('{} час {} минута {} секунд'.format(hours, minutes, seconds))

# 3. Узнайте у пользователя число n. Найдите сумму чисел n + nn + nnn. Например, пользователь ввёл число 3. Считаем 3 + 33 + 333 = 369.

number = int(input('Введите число'))

total = number + (number*11) + (number*111)

print('  Найдем сумму чисел n + nn + nnn =',total)

# 4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе. Для решения используйте цикл while и арифметические операции.

number = int(input('Введите целое положительно число'))
max_number = number % 10
number = number // 10
while number > 0:
    if number % 10 > max_number:
        max_number = number % 10
    number = number // 10
print('  Максимальное число в вашей цифре -',max_number)

# 5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма (прибыль — выручка больше издержек,
# или убыток — издержки больше выручки). Выведите соответствующее сообщение.
# Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке Прибыль / выручка * 100 % = рентабельность выручки).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

# 5. Запросите у пользователя значения выручки и издержек фирмы. Определите, с каким финансовым результатом работает фирма (прибыль — выручка больше издержек,
# или убыток — издержки больше выручки). Выведите соответствующее сообщение.


# Если фирма отработала с прибылью, вычислите рентабельность выручки (соотношение прибыли к выручке Прибыль / выручка * 100 % = рентабельность выручки).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника.

profit = int(input('Введите размер вашей выручки за год'))

payments = int(input('Введите размер ваших затрат за год'))

workers = int(input('Сколько у вас сотрудников?'))

profitability_of_sales =  int(((profit - payments) / profit ) * 100)

profit_of_worker = int(((profit - payments) / workers))

if profit > payments:

    print('Вы работаете в плюс, поздравляем вас!')
    print('Ваша рентабельность выручки составляет - ',profitability_of_sales, '%')
    print('Выручка на одного сотрудника фирмы составляет - ', profit_of_worker)

else:
    print('Вы работаете в минус вам нужно оптимизировать производство или оптимизировать стратегию бизнеса')


# 6. Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров. Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
#
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
#
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.
# Например: a = 2, b = 3.
# Результат:
# 1-й день: 2
# 2-й день: 2,2
# 3-й день: 2,42
# 4-й день: 2,66
# 5-й день: 2,93
# 6-й день: 3,22
#
# Ответ: на 6-й день спортсмен достиг результата — не менее 3 км.

a = 2
b = 3
days = 1

while a <= b and days > 0:

    print('День',days,'-', a, 'км')

    a =  a + ((a * 10) / 100)
    days += 1
print ('День когда спортмен достигнет своей цели! =',days + 1,'-', a, 'км')

