# 1. Выполнить логические побитовые операции «И», «ИЛИ» и др. над числами 5 и 6.
# Выполнить над числом 5 побитовый сдвиг вправо и влево на два знака.

# Присвоим переменным x и y значения чисел 5 и 6 соответсвенно
x = 5
y = 6
# Начем выполнять операции с ними. Начиная с & (И, AND)
z = x & y
print('x = ', x) #выведем для наглядности первый аргумент
print('y = ', y) #выведем для наглядности второй аргумент
print('z ' + 'результат операции & (И, AND) = ', z,  '\n') #и результат операции

# #выполним следующую операцию ИЛИ

# # Битовое ИЛИ (OR)
z = x | y
print('x = ', x)
print('y = ', y)
print('z ' + 'результат операции ИЛИ (OR) = ', z,  '\n')

#Выполним над числом 5 побитовый сдвиг вправо
print(x>>2)
#Выполним над числом 5 побитовый сдвиг влево
print(x<<2)

#Битовый оператор - исключающее ИЛИ (XOR)
z = x ^ y
print('x = ', x)
print('y = ', y)
print('z ' + 'исключающее ИЛИ (XOR) = ', z)

# 2. По введенным пользователем координатам двух точек вывести
# уравнение прямой вида y = kx + b, проходящей через эти точки.

# Получить значения координат первой точки и присвоить их переменным, например x1 и y1.
x1 = float(input('введите координату x1'))
y1 = float(input('введите координату y1'))
# Получить значения координат (x2, y2) второй точки.
x2 = float(input('введите координату x2'))
y2 = float(input('введите координату y2'))
# Вычислить значение k по формуле k = (y1 – y2) / (x1 – x2).
k = ((y1 - y2) / (x1 - x2))

print(f'{k:.2f}')

# Вычислить значение b по формуле b = y2 – k * x2.
b = y2 - (k * x2)
print(f'{b:.2f}')

print(f'y = (({k:.2f} * x) + {b:.2f})')

# 3. Написать программу, которая генерирует в указанных пользователем границах:
# a. случайное целое число,
# b. случайное вещественное число,
# c. случайный символ.
# Для каждого из трех случаев пользователь задает свои границы диапазона.
# Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы.
# Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.
import random

q = input('введите диапазон целых чисел через пробел').split(' ')

a = random.randrange(int(q[0]),int(q[1]))
print(a)


q_float = float(input('введите максимальный диапазон для вещественного числа больше которого оно не может быть'))
a = random.randrange(q_float)/1.3
print(float(f'{a:.3f}'))

#генерация случайной буквы
alphabet =['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q','R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

b = random.randint(0, 25)

print(alphabet[b])

#генерация случайной буквы в заданном диапазоне

letter_start = input('введите от какой буквы ')
letter_finish = input('введите до какой буквы ')
dic = {'a': 0, 'b': 1, 'c' : 2, 'd' : 3, 'e': 4, 'f': 5, 'g': 6, 'h': 7, 'i': 8, 'j': 9, 'k': 10, 'l': 11, 'm': 12, 'n': 13, 'o': 14, 'p': 15,
       'q': 16, 'r': 17, 's': 18, 't':19, 'u': 20, 'v': 21, 'w':22,'x' : 23,'y': 24, 'z':25}

alphabet =['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q','R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'Z']

b = random.randint(dic[letter_start], dic[letter_finish])

print(b) #берем рандомный индекс от алфавита в нужном диапазоне

print(alphabet[b]) #выводим результат в рандомном порядке

# 4. Пользователь вводит две буквы.
# Определить, на каких местах алфавита они стоят, и сколько между ними находится букв.
letter_start = input('введите от какой буквы ')
letter_finish = input('введите до какой буквы ')

dic = {'a': 0, 'b': 1, 'c' : 2, 'd' : 3, 'e': 4, 'f': 5, 'g': 6, 'h': 7, 'i': 8, 'j': 9, 'k': 10, 'l': 11, 'm': 12, 'n': 13, 'o': 14, 'p': 15,
       'q': 16, 'r': 17, 's': 18, 't':19, 'u': 20, 'v': 21, 'w':22,'x' : 23,'y': 24, 'z':25}

alphabet =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q','r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']
print(f'{dic[letter_start]+1} - место в алфавите')
print(f'{dic[letter_finish]+1} - место в алфавите')
print(f'{(dic[letter_finish]+1) - (dic[letter_start]+1)} - столько между ними букв')

# 5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

letter = int(input('введите букву числом '))

alphabet =['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o', 'p', 'q','r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z']

print(alphabet[letter-1])

# 6. По длинам трех отрезков, введенных пользователем, определить возможность существования
# треугольника, составленного из этих отрезков.
# Если такой треугольник существует, то определить,
# является ли он разносторонним, равнобедренным или равносторонним.
a = int(input('введите длину первой стороны'))
b = int(input('введите длину второй стороны'))
c = int(input('введите длину третьей стороны' + '\n'))
if a > 0 and b > 0 and c > 0:
    print('такой треугольник может существовать и он' + '\n')
    if a == b or a == c or b == c:
        print('равнобедренный')
    elif a == b and a == c and b == c:
        print('равносторонний')
    else:
        print('разносторонний')
else:
    print('треугольник не может существовать')

# 7. Определить, является ли год, который ввел пользователь, високосным или не високосным.
# номер которого кратен четырём, но исключение делалось для тех, которые были кратны 100.
# Такие годы были високосными только тогда, когда делились ещё и на 400.
year = int(input('Введите год для проверки високосный ли он'))

if year % 4 == 0 and year % 100 != 0 or year % 400 == 0:
    print('Да этот год високосный')
else:
    print('год не является високосным')
















